InformationRegisters/ФайлыОбластейДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ФайлыОбластейДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Comment>Размер файла версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТомНаДиске</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлCRC32</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьНаДиске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФайлыОбластейДанных/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
    
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ВыгрузитьФайл(ВыбраннаяСтрока);
    
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
    
    Отказ = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    
    Отказ = Истина;
    Если Копирование Тогда 
        Возврат;
    КонецЕсли; 
    Оповещение = Новый ОписаниеОповещения("ОбработкаПомещенияФайла", ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение);    
    
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
    
    Отказ = Истина;
    ВыбраннаяСтрока = Элементы.Список.ТекущаяСтрока;
    Если ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
        Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросУдаленияФайла", ЭтотОбъект, ВыбраннаяСтрока);
        ИмяФайла = Элементы.Список.ТекущиеДанные.Имя;
        ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить файл %1?'"), ИмяФайла); 
        ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
    КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОтветаНаВопросУдаленияФайла(КодВозврата, ВыбраннаяСтрока) Экспорт
	
    Если КодВозврата = КодВозвратаДиалога.Да Тогда
        УдалитьНаСервере(ВыбраннаяСтрока);
        Элементы.Список.Обновить();
    КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВыгрузитьФайл(ВыбраннаяСтрока)
	
    ОписаниеПередаваемогоФайла = ОписаниеПередаваемогоФайла(ВыбраннаяСтрока);
    Оповещение = Новый ОписаниеОповещения("НачатьПолучениеФайловЗавершение", ЭтотОбъект);
    ПолучаемыеФайлы = Новый Массив;
    ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
    ДиалогВыбораФайла.Фильтр = НСтр("ru='Все файлы (*.*)|*.*'"); 

    НачатьПолучениеФайлов(Оповещение, ПолучаемыеФайлы, ДиалогВыбораФайла);
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура УдалитьНаСервере(ВыбраннаяСтрока)
    
    РегистрыСведений.ФайлыОбластейДанных.Удалить(ВыбраннаяСтрока.Идентификатор);
    
КонецПроцедуры

&НаСервере
Функция ОписаниеПередаваемогоФайла(ВыбраннаяСтрока)
    
    Идентификатор = ВыбраннаяСтрока.Идентификатор;
    ОписаниеФайла = РегистрыСведений.ФайлыОбластейДанных.ОписаниеФайла(Идентификатор);
    Если ЗначениеЗаполнено(ОписаниеФайла.ПолноеИмя) Тогда
        ДвоичныеДанные = РегистрыСведений.ФайлыОбластейДанных.ДвоичныеДанныеФайла(Идентификатор);
    Иначе
        ДвоичныеДанные = ОписаниеФайла.Данные;
    КонецЕсли; 
    АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
    
    ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла;
    ОписаниеПередаваемогоФайла.Имя = ОписаниеФайла.Имя;
    ОписаниеПередаваемогоФайла.Хранение = АдресХранилища;
    
    Возврат ОписаниеПередаваемогоФайла;
    
КонецФункции

&НаКлиенте 
Процедура НачатьПолучениеФайловЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
    
    Если ЗначениеЗаполнено(ПолученныеФайлы) Тогда
        Оповещение = Новый ОписаниеОповещения("ПриНажатииОповещенияПолученияФайла", ЭтотОбъект, ПолученныеФайлы[0].Имя);
        ПоказатьОповещениеПользователя(НСтр("ru='Файл сохранен'"), Оповещение, ПолученныеФайлы[0].Имя, БиблиотекаКартинок.Информация32);     
    КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПомещенияФайла(ВыборВыполнен, АдресХранилища, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
    Если ВыборВыполнен Тогда
        ЗагрузитьФайл(АдресХранилища, ТолькоИмяФайла(ВыбранноеИмяФайла));
        Элементы.Список.Обновить();
    КонецЕсли; 	
    
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайл(АдресХранилища, ИмяФайла)
    
    Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	РегистрыСведений.ФайлыОбластейДанных.Загрузить(ИмяФайла, Данные); 
	
КонецПроцедуры
 
&НаКлиенте
Функция ТолькоИмяФайла(ВыбранноеИмяФайла)
	
	// Использовать критично на клиенте, т.к. ПолучитьРазделительПути() на сервере может быть другим.
	МассивПодстрок = СтрРазделить(ВыбранноеИмяФайла, ПолучитьРазделительПути(), Ложь);
	Возврат МассивПодстрок.Получить(МассивПодстрок.ВГраница());
	
КонецФункции

&НаКлиенте
Функция ПриНажатииОповещенияПолученияФайла(ПолноеИмяФайла) Экспорт
    
    ПустоеОповещение = Новый ОписаниеОповещения("ПустоеОповещение", ЭтотОбъект);
    НачатьЗапускПриложения(ПустоеОповещение, ПолноеИмяФайла,, Ложь);
	
КонецФункции

&НаКлиенте
Процедура ПустоеОповещение(КодВозврата, ДополнительныеПараметры) Экспорт
    
    Возврат;	
    
КонецПроцедуры
 
#КонецОбласти
